rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "The Tester"]]
---
  def similar_movies

    @movie = Movie.find(params[:id])
    @movies = Movie.where(director: @movie.director)